AboutContent =
[{
  "Title": "What is SmiteBuildMaker?",
  "Content": "SmiteBuildMaker is a personal fan-made project related to the video game SMITE that acts as a simulation of the in-game \"god builder\" with added features. It's design includes a single webpage that can be accessed cross-platform.<br>You can join the <a href='https://discord.gg/BYuUJ89CWq'>official Discord server here</a>."
  },
  {
    "Title": "Support The Development of This Website!",
    "Content": "Join the <a href='https://discord.gg/nEBXeQWzPR'>Discord Server</a>!<br><br>Donations help me live and let me keep working on websites like this. If you wish to donate, you can <a href='https://www.paypal.com/donate/?hosted_button_id=PL5XBNMDZXNPW'>do it here</a>."
  },
  {
    "Title": "Credits",
    "Content": "<strong>Malcastor</strong>: Original website idea<br><strong>u/Disguised_Demon</strong> on Reddit: Suggested God Passive Display<br><strong>u/thatendyperson</strong> on Reddit: Quick item descriptions<br><strong>u/nu7kevin</strong>: Healing rate"
  },
  {
    "Title": "Using The Terminal",
    "Content": "You can use the built-in terminal at any time and manually enter commands. This is for experimentation <em>and</em> accessibility. To use the terminal at any time, press the '~' key. Type 'help' to read all the available commands. Terminal is exclusive to the PC version of this website.<br><br><strong>Note</strong>: The terminal is not safeguarded from unexpected results in every case, such as invalid names or the wrong items on the wrong characters, so discretion is recommended."
  },
  {
    "Title": "Integrating With Your Website",
    "Content": "Want to display builds from your app/site using SBM? View <a href='https://github.com/MichaelWarmbier/Smite-API-Application/wiki/SmiteBuildMaker-Cross-Site-Integration'>this guide</a> to get started."
  },
  {
    "Title": "Frequently Asked Questions",
    "Content": "<strong>Q:</strong> Is this website open source?<br><strong>A:</strong> No. Suggestions are appreciated though, and I'm interested in working with contributers in the future.<br><br><strong>Q:</strong> There's a bug with the website! How can I contact you?<br><strong>A:</strong> You can contact me at business@smitebuildmaker.com.<br><br><strong>Q:</strong> The numbers are different than the in-game builder, what gives?<br><strong>A:</strong> The in-game builder may round different slightly or not include certain passives (which will be clearly shown in a future update). Additionally, the API data provided by Hi-Rez/Titanforge themselves may be inaccurate, and while I may make adjustments manually to compensate for this, it can't be guaranteed. If there are any major issue, you can always contact me.<br><br><strong>Q:</strong> Does this site work on both mobile and PC?<br><strong>A:</strong> Yes!<br><br><strong>Q:</strong> The website was updated without patch/update notes, why?<br><strong>A:</strong> The format for the patch follows the following format: Major_Update.Minor_Update.Patch_Update. Patch updates and some bug fixes are not included in update notes.<br><br><strong>Q:</strong> How do I access the terminal?<br><strong>A:</strong> The terminal can be opened using the '~' key. You can then type 'help' to get started.<br><br><strong>Q:</strong> How do the randomize buttons work?<br><strong>A:</strong> The random function will repeatedly try different items and see if they're allowed. It will only give you a Tier III or Tier IV item. Your first item will be a higher tier starter item, and if you're Ratatoskr you will instead start with a Tier III acorn.<br><br><strong>Q:</strong> How are save files stored?<br><strong>A:</strong> The save files rely on site cookies (no, not the ones that track your data). You can clear your saves by clearing your cookies for the website, and your saves will not carry over to another browser. Alternatively, you can hold onto the share links.<br><br><strong>Q:</strong> What is effective health?<br><strong>A:</strong> Effective health is the health you effectively have, based on damage reduction/mitigation, before protections are applied.<br><br><strong>Q:</strong> What is the number below the item icons?<br><strong>A:</strong> That is the total cost of the item. This cost includes all the lower-tier items that would be necessary to purchase it.<br><br><strong>Q:</strong> What languages do you support?<br><strong>A:</strong> Currently: English, Spanish, German and Polish.<br><br>"
}]