NewsContent =
[
  {
  "Title": "Smite Season/Year 11 Patch",
  "Content": "SBM is now updated for Smite V11.1!<br><br><span class='Enhancement_Label'>Enhancement</span> You can now select more than one glyph item<br><span class='Enhancement_Label'>Enhancement</span> Recipes and relevant items have been removed/added<br><span class='Bug_Label'>BugFix</span> Fixed some mobile visual errors<br>"
  },
  {
  "Title": "SmiteBuildMaker 5.0 (Alpha) IS OUT!",
  "Content": "Thank you for your patience! The redesign of SmiteBuildMaker is now released to the public! Some features are still being added and will be rolled out shortly as they're developed.<br><br>Please report any bugs to business@michaelwarmbier.com! If you feel like supporting the project, please consider donating at https://www.buymeacoffee.com/michaelwarmbier<br><br>Join the <a href='https://discord.gg/BYuUJ89CWq'>Official Discord server!</a>"
  },
  {
  "Title": "Future Revamp + Smite V10.9 [8/30/23] V4.1.6",
  "Content": "It's been awhile! If you don't already know, I'm a developer who works on several projects, and you can find out more about me here:<br><br><a href='http://michaelwarmbier.com'>My Website</a><br><br>But also, I've been working on <em>a lot</em> of different things besides Smite Build Maker! I haven't gotten around to improving the project in quite awhile. I'm hoping to change that soon. Here's what I'm planning:<br>- New website interface, completely redesigned<br>- Improved code making everything faster<br>- More languages implemented<br>- More features<br><br>This is going to take some time, so please be patient! In the meantime I will be updating SBM continously in-line with Smite, however, some features may take a bit to be released alongside updates. Additionally, if you want to keep updated you can still <strong>join the Discord server</strong> from the previous post or follow me on my Twitter where I will post updates.<br><br>Thank you all so much for your support on this project!"
  },
  {
  "Title": "DISCORD SERVER + Smite V10.6 [6/13/23] V4.1.0",
  "Content": "If you haven't already, you can now follow development through our new <a href='https://discord.gg/nEBXeQWzPR'>Discord Server</a>!<br>Speak a language and want to be credited on the website for helping make it more inclusive? Visit the Discord server to find out more!<br><br><span class='Enhancement_Label'>Enhancement</span> Improved About section<br><span class='Bug_Label'>BugFix</span> Fixed bug regarding inaccurate gold/silver prices; prices will now appear as intended.<br><span class='Bug_Label'>BugFix</span> Fixed issue with god/item search only working in English.<br><span class='Bug_Label'>BugFix</span> Fixed issue with site wide alert box appearing on mobile if a link was included."
  },
  {
  "Title": "State of Development + Smite V10.3 [3/29/23] V4.0.1",
  "Content": "Hi guys! I just wanted to give a brief update on the status of the website and why it seems like development has been inconsistent. For those unaware, I am a student. A lot of my time is taken up on work or school. Because of this, I haven't been able to work on SmiteBuildMaker as much as I'd like. But just to be clear: I will be! As soon as I get opportunities to dedicate more time to this site, I will. Please be assured I care a lot about this project and want to keep it updated and growing.<br>Thank you for your patience! As always, please inform me of any issues with the release of Smite V10.3"
  },
  {
  "Title": "Smite V10.2 and Major Update! [2/21/23] V4.0.0",
  "Content": "This update is primarily focused on adding language options to Smite Build Maker! If you're reading this <em>on release day</em>, only three languages: <strong>Spanish, German</strong> and <strong>Polish</strong> will be available immediate. The remaining few will be rolled out throughout the week. These include: <strong>Chinese French, Turkish, Russian</strong> and <strong>Portugese</strong>. Please let me know whenever you find a translation error, I want everything to be as accurate as possible!<br><br> <span class='Feature_Label'>Feature</span> Various language options now added as separate web pages.<br><span class='Feature_Label'>Feature</span>  Added double-click selection for Gods and items<br><span class='Feature_Label'>Feature</span> Added loading screen<br><span class='Enhancement_Label'>Feature</span> Terminal now saves recent commands, accessed by pressing the up arrow<br><span class='Enhancement_Label'>Feature</span> Replaced previously missing images for buffs with proper ones in game<br><span class='Bug_Label'>Feature</span> Fixed buff-stacking bug<br><span class='Bug_Label'>Feature</span> Fixed issue with damage reduction calculation<br><span class='Bug_Label'>Feature</span> Fixed build number misalignment<br><span class='Bug_Label'>Feature</span> Removed reset filter on God selection window<br>"
  },
  {
  "Title": "Season 10 Updates [1/24/23] V3.6.0",
  "Content": "Massives changes coming this patch, hopefully all of them included! There are plans for more updates coming in the future, I apologize for the hiatus!<br><br><span class='Feature_Label'>Feature</span> Added Surtr<br><span class='Feature_Label'>Feature</span> Added Gold and Silver Buff<br><span class='Feature_Label'>Feature</span> Removed enhanced buffs<br><span class='Feature_Label'>Feature</span> Added new items and item changes for S10<br><span class='Bug_Label'>BugFix</span> Fixed more mobile visuals<br>"
  },
  {
  "Title": "Post-Update Fixes and Additions Part 2 [9/28/22] V3.5.2",
  "Content": "<span class='Feature_Label'>Feature</span> Added item-specific gold to display<br><span class='Bug_Label'>BugFix</span> Fixed visual bugs with gold on mobile<br><span class='Bug_Label'>BugFix</span> Fixed visual bugs with item passives on mobile<br>"
  },
  {
  "Title": "Post-Updates Fixes and Additions [9/21/22] V3.5.1",
  "Content": "<span class='Feature_Label'>Feature</span> Added gold display and gold stat on items<br><span class='Feature_Label'>Feature</span> Visual improvements on mobile<br><span class='Bug_Label'>BugFix</span> Fixed ghost element preventing certain options from being selected from menus<br><span class='Bug_Label'>BugFix</span> Fixed issue with Lancelot not being included in God roster"
  },
  {
  "Title": "Visual Changes [9/20/22] V3.5.0",
  "Content": "<span class='Feature_Label'>Feature</span> Added Tier I masks' passives<br><span class='Feature_Label'>Feature</span> Added tooltip information in the center<br><span class='Feature_Label'>Feature</span> Hovering over an item tells you its name via tooltips<br><span class='Feature_Label'>Feature</span> More information added to 'About' section<br><span class='Feature_Label'>Feature</span> Added effective health<br><span class='Enhancement_Label'>Enhancement</span> Moved a cluster information to new footer on mobile and PC<br><span class='Enhancement_Label'>Enhancement</span> Added external links to mobile via the new footer<br><span class='Bug_Label'>BugFix</span> Fixed some windows not resetting scroll position"
  },
  {
  "Title": "Item Passives [9/6/22] V3.4.0",
  "Content": "It's been awhile since I've released a proper update. There's more I plan to add as soon as possible, but here's what I got for now: <br><br><span class='Feature_Label'>Feature</span> Added quick-email and Twitter link buttons<br><span class='Feature_Label'>Feature</span> Added a lot of item passives<br><span class='Feature_Label'>Feature</span> Added Cabrakan and Camazotz' God passives<br><span class='Feature_Label'>Feature</span> Re-introduced damage reduction stat to display<br><span class='Bug_Label'>BugFix</span> Adjusted stats display text to avoid clipping on some items<br><span class='Bug_Label'>BugFix</span> Updated Griffonwing to use correct passive description<br><span class='Bug_Label'>BugFix</span> Fixed some visual issues<br><br>Abilities, better filtering and more QOL changes to be added soon!"
  },
  {
  "Title": "Saves & Passives [7/26/22] V3.3.0",
  "Content": "This update focuses on adding more saves and providing more passive details. More passives <em>will</em> be added as soon as they can be.<br><br><span class='Feature_Label'>Feature</span> Added passive display window that gives information on currently applied passive effects<br><span class='Feature_Label'>Feature</span> Added new non-conquest balance patches<br><span class='Feature_Label'>Feature</span> Added up to ten save files<br><span class='Enhancement_Label'>Enhancement</span> Buffs now display their effects on the passive window (rather than their icon) making it easier for mobile users<br><span class='Bug_Label'>BugFix</span> Fixed bug with link sharing using old domain"
  },
  {
  "Title": "Some Bug Fixes [7/18/22] V3.2.0",
  "Content": "I'm adding a small patch for now while I work on the next update; this one focuses on a few bug fixes.<br><br><span class='Feature_Label'>Feature</span> Added unique consideration for Ratatoskr, similar to how it works in the in-game builder<br><span class='Bug_Label'>BugFix</span> Removed 'Malice'<br><span class='Bug_Label'>BugFix</span> Removed 'Sigil' item tree from magic damage items<br><span class='Bug_Label'>BugFix</span> Removed deadzone caused by buffs; subsequently moved buffs to top of selected Gods displays<br><br>Let me also apologize for saying that the last update had a new feature adding up to ten saves. Mistakenly, I forgot to remove this from the test patch notes before they went live. While this <em>is</em> an intended feature, it will be added in a later update."
  },
  {
  "Title": "More Content! [7/10/22] V3.1.0",
  "Content": "Starting off strong and following up the last update with some much needed additions and changes; some of which were requested quite awhile ago.<br><br><span class='Feature_Label'>Feature</span> Added an option to randomize exclusively items and keep selected God the same</br><span class='Feature_Label'>Feature</span> Added elixirs and potions to the buff menu and changed the visualization of each one to fit together<br><span class='Enhancement_Label'>Enhancement</span> Improved visuals on lower mobile resolutions<br><span class='Enhancement_Label'>Enhancement</span> Terminal is now fully functional and can be used to interact with the website manually<br><span class='Bug_Label'>BugFix</span> Fixed bug where the stat bar for critical strike chance wasn't working properly<br><span class='Bug_Label'>BugFix</span> Fixed bug where speed buff wasn't applying"
  },
  {
  "Title": "Mobile Update [7/8/22] V3.0",
  "Content": "After taking a break and working on another project of mine, the next update for SmiteBuildMaker is finally here! With this update, the CSS and overall website structure, as well as the code that it runs on have <em>both</em> been optimized; both to avoid headaches for me in the future and to make everything a bit easier to use. Here are the main updates:<br><br><span class='Enhancement_Label'>Enhancement</span> Improved website speed<br><span class='Enhancement_Label'>Enhancement</span> Improved front-end</br><span class='Enhancement_Label'>Enhancement</span> Improved back-end<br><span class='Enhancement_Label'>Enhancement</span> Removed mobile page; Page now reacts to screen size and converts to mobile format automatically<br><span class='Enhancement_Label'>Enhancement</span> Improved stability of randomize<br><span class='Feature_Label'>Feature</span> Added second god to mobile<br><span class='Feature_Label'>Feature</span> Added local save and load options"
  },
  {
  "Title": "Patch 9.5 Balance Update [5/22/22] V2.1.2",
  "Content": "This update arrived later than I initially intended. The only things that were changed were the health numbers and normal changes included in V9.5 of SMITE. But I also wanted to make a point to mention that additions for the site will be halted for a brief time while I focus on revamping the UI. Currently, the site is functional on all relevant browsers, but with visual glitches that are likely to get worse in the future. Please be patient while these changes take place. This will NOT affect SMITE updates and I will continue to try to add every patch as soon as possible."
  },
  {
    "Title": "Quality of Life Update [4/30/22] V2.1",
    "Content": "This update adds the following QOL changes and features:<br><br><span class='Enhancement_Label'>Enhancement</span> Seperated 'Penetration' and 'Percent Penetration' into two different stat bars.<br><span class='Enhancement_Label'>Enhancement</span> Removed 'Armour Reduction' stat, still internally exists.<br><span class='Enhancement_Label'>Enhancement</span> Shortened links for link sharing.<br><span class='Enhancement_Label'>Enhancement</span> Added better search (mostly affects PC).<br><span class='Feature_Label'>Feature</span> Item info now persists to make checking an items information, again, easier.<br><span class='Feature_Label'>Feature</span> Added 'Randomizer' button (PC exclusive).<br><br>I'm aware of the clear decline in quality on the mobile page of this website, a future update is planned to address that by being dedicated to revamping the mobile version."
  },
  {
    "Title": "Massive Feature Update [4/21/22] V2",
    "Content": "This major update adds and changes the following:<br><br><span class='Feature_Label'>Feature</span> Added visible stat cap gradient bars.<br><span class='Feature_Label'>Feature</span> Added 'Console Window' which can be opened by using the ~ key.<br><span class='Feature_Label'>Feature</span> Added all buffs, buffs use their Conquest statistics in calculation.<br><span class='Feature_Label'>Feature</span> Added build number toggle.<br><span class='Feature_Label'>Feature</span> Added link sharing.<br><span class='Enhancement_Label'>Enhancement</span> Removed HP5 and MP5 consideration<br><span class='Bug_Label'>BugFix</span> Fixed a bug with the delete item option not working as intended.<br><span class='Bug_Label'>BugFix</span> Fixed issues with 'Glyph' items.<br><br>Some things to note:<br><br>- Item passives and some god passives are still not here yet, so items like Transendence and Pendulum of Ages' mana conversion will have to wait until a future update. These passives <em>will</em> be toggle-able.<br>- Buff descriptions can be read by hovering over their icon on the God card.<br>"
  },
  {
    "Title": "Some Visual Changes [4/6/22] V1.2",
    "Content": "This minor update changes the following:<br><br><span class='Enhancement_Label'>Enhancement</span> \"Fire Giant Buffs\" are now larger and thus more visible on the God card.<br><span class='Enhancement_Label'>Enhancement</span> \"News\" tab replaced with \"Info\" tab, displays news and site information separately.<br><span class='Feature_Label'>Feature</span> God pantheons and roles now display with their respective icons.<br>"
  },
  {
    "Title": "Website Released! [3/25/22] V1 - V1.0.1",
    "Content": "SmiteBuildMaker is now available to the public! Not every update I wanted to release with is here, but they're coming. Have suggestions? Email me at business@smitebuildmaker.com and I'll see what I can do!"
}]